hasuracon_june_2022/README.org
#+TITLE: Securing your GraphQL API with Hasura
#+SUBTITLE: HasuraCon 2022
#+AUTHOR: David A. Ventimiglia
#+EMAIL: davidaventimiglia@hasura.io

#+options: timestamp:nil title:t toc:nil todo:t |:t num:t author:nil

#+REVEAL_DEFAULT_SLIDE_BACKGROUND: ./slide_background.png
#+REVEAL_INIT_OPTIONS: transition:'none', controlsLayout:'edges', progress:false, controlsTutorial:false
#+REVEAL_THEME: black
#+REVEAL_TITLE_SLIDE_BACKGROUND: ./slide_background.png

* Introduction

*** Principles

- Risk Management :: /Life is about trade-offs./
- Goal Setting :: /Confidentiality, Integrity, Availability/
- Defense in Depth :: /Bottom-Up/
- Simplicity :: /Complexity is the Enemy of Security/
- Least Privilege :: /The most secure API does nothing at all./

*** Threats

- Deep Queries :: /Confidentiality, Availability/
- Recursive Queries :: /Availability/
- Unbounded Queries :: /Confidentiality, Availability/
- Batch Requests :: /Confidentiality, Availability/

*** Application

- [ ] +Secure the DB+
- [X] Secure the Service
- [ ] +Add Authentication+
- [ ] +Disable Hasura Console+
- [X] Disable Schema Introspection
- [X] Create a Securable Data Model
- [X] Set API Limits
- [X] Apply Permissions
- [X] Use Allow Lists
- [X] Create REST Endpoints

* Workshop

*** Setup: Log into Heroku

*** Setup: Log into Hasura Cloud

*** Setup: Create a new Hasura Cloud Project

*** Setup: Create a new Heroku database

*** Setup: Connect to the database (OPTIONAL)

*** Secure the DB (OPTIONAL)

*** Secure the Service

- Admin Secret :: /prevent public access/

*** Add Authentication (OPTIONAL)

*** Disable Hasura Console (OPTIONAL)

*** Disable Schema Introspection

*** Create a Securable Data Model

*** Set API Limits

*** Apply Permissions

*** Use Allow Lists

*** Create REST Endpoints

* Discussion

*** GraphQL Security Orthodoxy

AKA: rituals, cargo cults, security theater which you can get anywhere
- Disable Console Access
- Disable Schema Introspection
- Disable Query Suggestions (unneccessary in Hasura)
- Impose API Limits
- Whitelist Operations

*** GraphQL Security Heterodoxy

AKA: possibly controversial opinions which you will get from me
- Don't confuse public vs private:
- If you don't /need/ to provide a public API, then don't.
- If you're not providing a public API, then don't act like you are.
- Don't disable console access
- If you applied the security principles carefully, deliberately, thoughtfully, then the console can't do anything unauthorized anyway.
- Don't disable schema introspection and query suggestions.
- The public will need to know how to use your public API (which you almost certainly shouldn't have anyway)
- The public shouldn't have access to your private API (you did secure your API, add authentication, disable unauthorized access, build a rich data model, and apply fine-graned authorization, didn't you?)
- The information will get out anyway.
- Don't use GraphQL security
- Or at least, don't rely on it.
- Work diligently from the bottom-up, applying the principles carefully, deliberately, thoughtfully, and you (almost) won't need it.
- Remember "managing risk", "cargo cults", and "security theater".
Life is about trade-offs.
- Don't use GraphQL
- For private APIs, that is.
- Use Allow Lists.
- And if you're using Allow Lists, you might as well use REST endpoints.
- GraphQL is for /people/ (i.e. developers), not for machines.

* Closing Remarks

*** References

*** How and where to get help

white_check_mark
100
raised_hands
