hasuracon_june_2022/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Securing your GraphQL API with Hasura</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Securing your GraphQL API with Hasura
<br />
<span class="subtitle">HasuraCon 2022</span>
</h1>

<div id="outline-container-org3f0cd49" class="outline-2">
<h2 id="org3f0cd49"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0fa2a0b" class="outline-3">
<h3 id="org0fa2a0b"><span class="section-number-3">1.1.</span> Principles</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt>Risk Management</dt><dd><i>Life is about trade-offs.</i></dd>
<dt>Goal Setting</dt><dd><i>Confidentiality, Integrity, Availability</i></dd>
<dt>Defense in Depth</dt><dd><i>Bottom-Up</i></dd>
<dt>Simplicity</dt><dd><i>Complexity is the Enemy of Security</i></dd>
<dt>Least Privilege</dt><dd><i>The most secure API does nothing at all.</i></dd>
</dl>
</div>
</div>

<div id="outline-container-org78fa51f" class="outline-3">
<h3 id="org78fa51f"><span class="section-number-3">1.2.</span> Threats</h3>
<div class="outline-text-3" id="text-1-2">
<dl class="org-dl">
<dt>Deep Queries</dt><dd><i>Confidentiality, Availability</i></dd>
<dt>Recursive Queries</dt><dd><i>Availability</i></dd>
<dt>Unbounded Queries</dt><dd><i>Confidentiality, Availability</i></dd>
<dt>Batch Requests</dt><dd><i>Confidentiality, Availability</i></dd>
</dl>
</div>
</div>

<div id="outline-container-orgf90ca4e" class="outline-3">
<h3 id="orgf90ca4e"><span class="section-number-3">1.3.</span> Application</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <del>Secure the DB</del></li>
<li class="on"><code>[X]</code> Secure the Service</li>
<li class="off"><code>[&#xa0;]</code> <del>Add Authentication</del></li>
<li class="off"><code>[&#xa0;]</code> <del>Disable Hasura Console</del></li>
<li class="on"><code>[X]</code> Disable Schema Introspection</li>
<li class="on"><code>[X]</code> Create a Securable Data Model</li>
<li class="on"><code>[X]</code> Set API Limits</li>
<li class="on"><code>[X]</code> Apply Permissions</li>
<li class="on"><code>[X]</code> Use Allow Lists</li>
<li class="on"><code>[X]</code> Create REST Endpoints</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga01e987" class="outline-2">
<h2 id="orga01e987"><span class="section-number-2">2.</span> Workshop</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0f269c4" class="outline-3">
<h3 id="org0f269c4"><span class="section-number-3">2.1.</span> Setup: Log into Heroku</h3>
</div>

<div id="outline-container-org2d8a65d" class="outline-3">
<h3 id="org2d8a65d"><span class="section-number-3">2.2.</span> Setup: Log into Hasura Cloud</h3>
</div>

<div id="outline-container-org2fb297a" class="outline-3">
<h3 id="org2fb297a"><span class="section-number-3">2.3.</span> Setup: Create a new Hasura Cloud Project</h3>
</div>

<div id="outline-container-org1411ccd" class="outline-3">
<h3 id="org1411ccd"><span class="section-number-3">2.4.</span> Setup: Create a new Heroku database</h3>
</div>

<div id="outline-container-orgd5eba35" class="outline-3">
<h3 id="orgd5eba35"><span class="section-number-3">2.5.</span> Setup: Connect to the database (OPTIONAL)</h3>
</div>

<div id="outline-container-org6ad2877" class="outline-3">
<h3 id="org6ad2877"><span class="section-number-3">2.6.</span> Secure the DB (OPTIONAL)</h3>
</div>

<div id="outline-container-org591be3c" class="outline-3">
<h3 id="org591be3c"><span class="section-number-3">2.7.</span> Secure the Service</h3>
<div class="outline-text-3" id="text-2-7">
<dl class="org-dl">
<dt>Admin Secret</dt><dd><i>prevent public access</i></dd>
</dl>
</div>
</div>

<div id="outline-container-orgbc411c0" class="outline-3">
<h3 id="orgbc411c0"><span class="section-number-3">2.8.</span> Add Authentication (OPTIONAL)</h3>
</div>

<div id="outline-container-orged9855a" class="outline-3">
<h3 id="orged9855a"><span class="section-number-3">2.9.</span> Disable Hasura Console (OPTIONAL)</h3>
</div>

<div id="outline-container-orgd419aff" class="outline-3">
<h3 id="orgd419aff"><span class="section-number-3">2.10.</span> Disable Schema Introspection</h3>
</div>

<div id="outline-container-org6847251" class="outline-3">
<h3 id="org6847251"><span class="section-number-3">2.11.</span> Create a Securable Data Model</h3>
</div>

<div id="outline-container-org3ebe2e3" class="outline-3">
<h3 id="org3ebe2e3"><span class="section-number-3">2.12.</span> Set API Limits</h3>
</div>

<div id="outline-container-orgba63141" class="outline-3">
<h3 id="orgba63141"><span class="section-number-3">2.13.</span> Apply Permissions</h3>
</div>

<div id="outline-container-org9bc0109" class="outline-3">
<h3 id="org9bc0109"><span class="section-number-3">2.14.</span> Use Allow Lists</h3>
</div>

<div id="outline-container-orgf3d64a3" class="outline-3">
<h3 id="orgf3d64a3"><span class="section-number-3">2.15.</span> Create REST Endpoints</h3>
</div>
</div>

<div id="outline-container-org554ce71" class="outline-2">
<h2 id="org554ce71"><span class="section-number-2">3.</span> Discussion</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgaa305e2" class="outline-3">
<h3 id="orgaa305e2"><span class="section-number-3">3.1.</span> GraphQL Security Orthodoxy</h3>
<div class="outline-text-3" id="text-3-1">
<p>
AKA: rituals, cargo cults, security theater which you can get anywhere
</p>
<ul class="org-ul">
<li>Disable Console Access</li>
<li>Disable Schema Introspection</li>
<li>Disable Query Suggestions (unneccessary in Hasura)</li>
<li>Impose API Limits</li>
<li>Whitelist Operations</li>
</ul>
</div>
</div>

<div id="outline-container-orgb59c080" class="outline-3">
<h3 id="orgb59c080"><span class="section-number-3">3.2.</span> GraphQL Security Heterodoxy</h3>
<div class="outline-text-3" id="text-3-2">
<p>
AKA: possibly controversial opinions which you will get from me
</p>
<ul class="org-ul">
<li>Don't confuse public vs private:</li>
<li>If you don't <i>need</i> to provide a public API, then don't.</li>
<li>If you're not providing a public API, then don't act like you are.</li>
<li>Don't disable console access</li>
<li>If you applied the security principles carefully, deliberately, thoughtfully, then the console can't do anything unauthorized anyway.</li>
<li>Don't disable schema introspection and query suggestions.</li>
<li>The public will need to know how to use your public API (which you almost certainly shouldn't have anyway)</li>
<li>The public shouldn't have access to your private API (you did secure your API, add authentication, disable unauthorized access, build a rich data model, and apply fine-graned authorization, didn't you?)</li>
<li>The information will get out anyway.</li>
<li>Don't use GraphQL security</li>
<li>Or at least, don't rely on it.</li>
<li>Work diligently from the bottom-up, applying the principles carefully, deliberately, thoughtfully, and you (almost) won't need it.</li>
<li>Remember "managing risk", "cargo cults", and "security theater".</li>
</ul>
<p>
Life is about trade-offs.
</p>
<ul class="org-ul">
<li>Don't use GraphQL</li>
<li>For private APIs, that is.</li>
<li>Use Allow Lists.</li>
<li>And if you're using Allow Lists, you might as well use REST endpoints.</li>
<li>GraphQL is for <i>people</i> (i.e. developers), not for machines.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org437ebe6" class="outline-2">
<h2 id="org437ebe6"><span class="section-number-2">4.</span> Closing Remarks</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7af48f2" class="outline-3">
<h3 id="org7af48f2"><span class="section-number-3">4.1.</span> References</h3>
</div>

<div id="outline-container-org63e27d5" class="outline-3">
<h3 id="org63e27d5"><span class="section-number-3">4.2.</span> How and where to get help</h3>
<div class="outline-text-3" id="text-4-2">
<p>
white<sub>check</sub><sub>mark</sub>
100
raised<sub>hands</sub>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
